# Java学习

## 前言

**1.双非在校大学生，想通过自学Java进大厂**

**2.给跟我一样的大学生分享我的经历，和学习资源**

**3.本版块将会记录从Java入门到就业的所有学习笔记和资源**

**4.我还会分享我在学习Java中遇到的各种问题和各种解决方法**

***



## 阶段1 Java入门

### 一，Java编程基础

这个阶段特别重要，是以后Java学习的基础，所以选对好的资源和老师十分重要，我给大家推荐的是韩顺平老师的[《韩顺平零基础30天学会Java》]( https://b23.tv/QS6pdGe),真的讲得特别好，每个知识点都讲的非常细，特别适合零基础的小伙伴们，他会将每一阶段的重点讲明，每个阶段结束之后还会带领大家做各种各样有意思的项目。**而且不仅课讲得好，还会将上课内容整理成笔记，开发要用到的工具的安装包，上课和项目的代码，PPT还有一些学习资料都会发给你（加他微信，也可以直接问我要）**，但我还是建议大家要自己养成做笔记的好习惯，毕竟每个人的思维方式不同，自己做的笔记还是更容易理解，我也会每天分享自己的学习笔记，跟大家一起学习，一起进步。好了，接下来让我们开始Java编程基础的学习吧。



### 1. 配置Java的开发环境--JDK

#### 1.那什么是 JDK呢

JDK是Java开发工具包，JDK = JRE + Java 的开发工具（java，javac，Javadoc，javap等）

#### 2.那什么又是JRE呢

JRE是Java的运行环境，JRE=JVM+Java的核心内库

#### 3.那什么又是JVM呢

JVM就是Java虚拟机，JVM可以实现一次编译，到处运行，也就是可以跨平台运行，既可以在Windows操作系统执行也可以在Linux和Mac操作系统运行，但不同的平台，也有不同的虚拟机。

#### 4.配置JDK（保姆级教学）

**在我们开始学习Java之前，首先我们要安装Jdk，这个安装很简单只要到韩老师的资源里找jdk的安装包就能免费安装,接下来我主要讲的是jdk的环境配置，也就是配置环境变量path**

* 配置环境变量path的步骤

  **1.我的电脑--属性(右键)--高级系统设置--环境变量**

  **2.增加JAVA_HOME环境变量**

  **3.编辑path环境变量，增加%JAVA_HOME%\bin**

  **4.打开doc命令行，任意目录下输入javac/java，如果出先javac的参数信息就配置成功了**

以下是**具体操作**

首先我们右键我的电脑点击属性,选择高级系统设置<img src="D:\大二\my3.png" style="zoom: 50%;" />

进入之后点击最下方的环境变量

<img src="D:\大二\my4.png" style="zoom: 67%;" />

新建一个系统变量JAVA_HOME

<img src="D:\大二\my10.png" style="zoom:67%;" />

变量名JAVA_HOME，变量地址就是JDK的安装路径，点击确定

<img src="D:\大二\my11.png" style="zoom:67%;" />

接下来编辑Path变量，点击Path

<img src="D:\大二\my7.png" style="zoom:67%;" />

新建%JAVA_HOME%\bin,然后全部点击确定，我们的环境就配置好了

<img src="D:\大二\my8.png" style="zoom: 67%;" />

接下来我们来测验一下，我们采用win+R打开运行，在运行框内输入cmd，点击确定   

![](D:\大二/my1.png)

出现doc命令行，输入java出现如下信息就成功了。

<img src="D:\大二/my6.png" style="zoom: 50%;" />

​                                                                    ***本小节的内容就全部结束了，我们下一节再见***

